iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/УБХЗемельныеУчастки/УБХЗемельныеУчастки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБХЗемельныеУчастки</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.УБХСтатусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрава</name>
    <type>
      <types>CatalogRef.гисВидыПравНаКадастровыйУчасток</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЕГРН</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадастровыйНомерЧасти</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПоиска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>DefinedType.УБХКоординаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>DefinedType.УБХКоординаты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресНГ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КадастровыйКвартал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиНаУчет</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадастровыйНомер1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗемель</name>
    <type>
      <types>CatalogRef.гисКатегорииЗемель</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИспользования</name>
    <type>
      <types>CatalogRef.гисВидыРазрешенногоИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенноеИспользованиеПоДокументу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АрендуемаяПлощадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадастроваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадастроваяСтоимостьМетра</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУтвержденияСтоимости</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоположениеАМС</name>
    <type>
      <types>EnumRef.УБХМестоположенияАМСОтносительноЗУ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеОграждения1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеОграждения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьОграждения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЗаОграждением</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаЛегализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыкупа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДляРазмещенияОбъекта</name>
    <type>
      <types>CatalogRef.гисВидыПравНаКадастровыйУчасток</types>
    </type>
  </attributes>
  <attributes>
    <name>АктивныйКандидат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСогласованияМФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСогласованияЗИК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаписиОбъектаНедвижимости</name>
    <type>
      <types>EnumRef.УБХСтатусыЗаписиОбОбъектеНедвижимости</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбъекта</name>
    <type>
      <types>CatalogRef.гисСтатусыКадастровыхУчастков</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа1С</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Код1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредствоSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияКУчету</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСнятияСУчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыЗУ</name>
    <type>
      <types>EnumRef.УБХОбъектыЗУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобаяКатегория</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЛесныеУчастки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыкупНеВозможен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииПрава1С</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияПрава1С</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.УБХПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Правообладатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыГосРегистрацииПрава</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераГосРегистрацииПрава</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатыГосРегистрацииПрава</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыОбременений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатыГосРегистрацииОбременений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераГосРегистрацииОбременений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокиОбременений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицаОбременений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованияРегистрацииОбременений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПраваЗУ</name>
    <attributes>
      <name>Правообладатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидГосРегистрацииПрава</name>
      <type>
        <types>EnumRef.УБХВидыГосРегистрацииПрава</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГосРегистрацииПрава</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаГосРегистрацииПрава</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбремененияЗУ</name>
    <attributes>
      <name>ВидОбременения</name>
      <type>
        <types>CatalogRef.УБХВидыОграниченийИОбремененийЗУ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаГосРегистрацииОбременения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГосРегистрацииОбременения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокОбременения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛицоОбременения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеРегистрацииОбременения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/УБХЗемельныеУчастки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
Процедура ПередЗаписью(Отказ)
	
	Правообладатели 				= "";
	ВидыГосРегистрацииПрава 		= "";
	НомераГосРегистрацииПрава	 	= "";
	ДатыГосРегистрацииПрава 		= "";
	
	ВидыОбременений 				= "";
	ДатыГосРегистрацииОбременений 	= "";
	НомераГосРегистрацииОбременений = "";
	СрокиОбременений 				= "";
	ЛицаОбременений 				= "";
	ОснованияРегистрацииОбременений = "";
	
	Для Каждого СтрокаТЧ Из ПраваЗУ Цикл
		Правообладатели 			= Правообладатели 			+ ?(Правообладатели = "", "", "; ") 			+ СтрокаТЧ.Правообладатель;
		ВидыГосРегистрацииПрава 	= ВидыГосРегистрацииПрава 	+ ?(ВидыГосРегистрацииПрава = "", "", "; ")		+ СтрокаТЧ.ВидГосРегистрацииПрава;
		НомераГосРегистрацииПрава 	= НомераГосРегистрацииПрава + ?(НомераГосРегистрацииПрава = "", "", "; ") 	+ СтрокаТЧ.НомерГосРегистрацииПрава;
		ДатыГосРегистрацииПрава 	= ДатыГосРегистрацииПрава 	+ ?(ДатыГосРегистрацииПрава = "", "", "; ") 	+ СтрокаТЧ.ДатаГосРегистрацииПрава;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из ОбремененияЗУ Цикл
		ВидыОбременений 				= ВидыОбременений 					+ ?(ВидыОбременений = "", "", "; ") 				+ СтрокаТЧ.ВидОбременения;
		ДатыГосРегистрацииОбременений 	= ДатыГосРегистрацииОбременений 	+ ?(ДатыГосРегистрацииОбременений = "", "", "; ") 	+ СтрокаТЧ.ДатаГосРегистрацииОбременения;
		НомераГосРегистрацииОбременений = НомераГосРегистрацииОбременений 	+ ?(НомераГосРегистрацииОбременений = "", "", "; ") + СтрокаТЧ.НомерГосРегистрацииОбременения;
		СрокиОбременений 				= СрокиОбременений 					+ ?(СрокиОбременений = "", "", "; ") 				+ СтрокаТЧ.СрокОбременения;
		ЛицаОбременений 				= ЛицаОбременений 					+ ?(ЛицаОбременений = "", "", "; ") 				+ СтрокаТЧ.ЛицоОбременения;
		ОснованияРегистрацииОбременений = ОснованияРегистрацииОбременений 	+ ?(ОснованияРегистрацииОбременений = "", "", "; ") + СтрокаТЧ.ОснованиеРегистрацииОбременения;
	КонецЦикла;
	
КонецПроцедуры
	
#КонецЕсли
